; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	spectrograph0 - mode
	thermograph3 - mode
	thermograph2 - mode
	image4 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation3 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Star12 - direction
	Planet13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image4)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 image4)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star14)
	(supports instrument3 image4)
	(supports instrument3 thermograph3)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument4 spectrograph0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
)
(:goal (and
	(pointing satellite1 Star11)
	(pointing satellite3 Phenomenon10)
	(have_image Planet5 thermograph2)
	(have_image Star6 thermograph3)
	(have_image Star7 thermograph1)
	(have_image Planet8 thermograph1)
	(have_image Planet9 thermograph3)
	(have_image Phenomenon10 thermograph1)
	(have_image Star11 spectrograph0)
	(have_image Star12 spectrograph0)
	(have_image Planet13 thermograph2)
	(have_image Star14 thermograph1)
))

)

; plan
1. (turn_to satellite2 groundstation4 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 groundstation4)
   goals met: 0 of 12
2. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 0 of 12
3. (calibrate satellite2 instrument3 groundstation4)
   added: (calibrated instrument3)
   goals met: 0 of 12
4. (turn_to satellite2 planet9 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 planet9)
   goals met: 0 of 12
5. (take_image satellite2 planet9 instrument3 thermograph3)
   added: (have_image planet9 thermograph3)
   goals met: 1 of 12
6. (turn_to satellite2 planet5 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 planet5)
   goals met: 1 of 12
7. (take_image satellite2 planet5 instrument3 thermograph2)
   added: (have_image planet5 thermograph2)
   goals met: 2 of 12
8. (turn_to satellite2 planet13 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 planet13)
   goals met: 2 of 12
9. (turn_to satellite1 groundstation4 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 groundstation4)
   goals met: 2 of 12
10. (take_image satellite2 planet13 instrument3 thermograph2)
   added: (have_image planet13 thermograph2)
   goals met: 3 of 12
11. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 3 of 12
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 12
13. (calibrate satellite1 instrument1 groundstation4)
   added: (calibrated instrument1)
   goals met: 3 of 12
14. (calibrate satellite0 instrument0 star2)
   added: (calibrated instrument0)
   goals met: 3 of 12
15. (turn_to satellite0 phenomenon10 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 12
16. (take_image satellite0 phenomenon10 instrument0 thermograph1)
   added: (have_image phenomenon10 thermograph1)
   goals met: 4 of 12
17. (turn_to satellite0 planet8 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 planet8)
   goals met: 4 of 12
18. (take_image satellite0 planet8 instrument0 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 5 of 12
19. (turn_to satellite0 star14 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star14)
   goals met: 5 of 12
20. (take_image satellite0 star14 instrument0 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 6 of 12
21. (turn_to satellite0 star7 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star7)
   goals met: 6 of 12
22. (take_image satellite0 star7 instrument0 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 7 of 12
23. (turn_to satellite1 star12 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star12)
   goals met: 7 of 12
24. (take_image satellite1 star12 instrument1 spectrograph0)
   added: (have_image star12 spectrograph0)
   goals met: 8 of 12
25. (turn_to satellite1 star11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star11)
   goals met: 9 of 12
26. (take_image satellite1 star11 instrument1 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 10 of 12
27. (turn_to satellite2 star6 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 star6)
   goals met: 10 of 12
28. (take_image satellite2 star6 instrument3 thermograph3)
   added: (have_image star6 thermograph3)
   goals met: 11 of 12
29. (turn_to satellite3 phenomenon10 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 phenomenon10)
   goals met: 12 of 12
